<script setup></script>

<!-- * 6.0 Здесь мы рассмотрим понятие «Layouts» во Vue на примере простенького компонента "Flexbox". Здесь мы просто распечатываем 15 маленьких блочков с индексом внутри вместо текстовой ноды. А дальше мы можем начинать эксперименты с флексами. -->
<!-- 6.1 "flex-shrink-0" позаботится о том, чтобы флекс-элементы оставались квадратным, независимо от того, насколько узкий будет экран. -->
<!-- 6.2 Если мы укажем "flex-col", то флекс-элементы сменят ось "flex-direction: column;" и если мы ограничим высоту их контейнеру, то они будут переноситься на новый столбик внутри этого контейнера. -->
<!-- 6.3 Чтобы потестить позиционирование флекс-элементов по Y-оси зададим каждому из них разные высоты с помощью стилей. И сперва мы увидим, что все элементы расположены по верхнему краю, но если добавить "items-center" то ситуация изменится. -->
<template>
  <!-- <section class="flex flex-col flex-wrap justify-around gap-2 h-[50vh]"> -->
  <section class="flex flex-wrap justify-center items-center gap-2">
    <div
      v-for="i in 15"
      :key="i"
      class="flex-shrink-0 p-4 text-center text-white bg-gray-500 w-14 h-14"
      :style="`height: ${i * 30 + 30}px`"
    >
      {{ i }}
    </div>
  </section>
</template>
